alibaba/AliOS-Things/platform/mcu/stm32l4xx/src/STM32L496G-Discovery/Kids_A20/soc_init.c
    /**Initializes the CPU, AHB and APB busses clocks 
    */
    /*xiehj add RCC_OSCILLATORTYPE_HSI48*/
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_LSE|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  /*xiehj add*/
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART2|RCC_PERIPHCLK_USART3
                              |RCC_PERIPHCLK_LPUART1|RCC_PERIPHCLK_SAI2
                              |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_I2C2
                              |RCC_PERIPHCLK_I2C3|RCC_PERIPHCLK_USB
                              |RCC_PERIPHCLK_SDMMC1|RCC_PERIPHCLK_ADC;
  PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
  PeriphClkInit.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
  PeriphClkInit.Lpuart1ClockSelection = RCC_LPUART1CLKSOURCE_PCLK1;
  PeriphClkInit.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
  PeriphClkInit.I2c2ClockSelection = RCC_I2C2CLKSOURCE_PCLK1;
  PeriphClkInit.I2c3ClockSelection = RCC_I2C3CLKSOURCE_PCLK1;
  PeriphClkInit.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLSAI1;
  PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_PLLSAI1;
  PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_PLLSAI1;
  PeriphClkInit.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_PLLSAI1;
  PeriphClkInit.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_MSI;
  PeriphClkInit.PLLSAI1.PLLSAI1M = 1;
  PeriphClkInit.PLLSAI1.PLLSAI1N = 24;
  PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_SAI1CLK|RCC_PLLSAI1_48M2CLK
                              |RCC_PLLSAI1_ADC1CLK;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  /*xiehj add*/
  HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI48, RCC_MCODIV_2);
  
    /**Configure the main internal regulator output voltage 
    */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/8/RHINO_CONFIG_TICKS_PER_SECOND);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK_DIV8);

    /**Enable MSI Auto calibration 
    */
  HAL_RCCEx_EnableMSIPLLMode();

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

#ifdef ALIOS_HAL
static gpio_irq_trigger_t mode_rising = IRQ_TRIGGER_RISING_EDGE;
static gpio_irq_trigger_t mode_falling = IRQ_TRIGGER_FALLING_EDGE;
static gpio_irq_trigger_t mode_both = IRQ_TRIGGER_BOTH_EDGES;
static uint8_t gpio_set = 1;
static uint8_t gpio_reset = 0;

gpio_dev_t brd_gpio_table[] = {
	{ALS_INT, IRQ_MODE, &mode_rising},
	{ALS_LED, OUTPUT_PUSH_PULL, &gpio_set},
	{AUDIO_CTL, OUTPUT_PUSH_PULL, &gpio_reset},
	{AUDIO_RST, OUTPUT_PUSH_PULL, &gpio_set},
	{AUDIO_WU, OUTPUT_PUSH_PULL, &gpio_set},
	{CAM_PD, OUTPUT_PUSH_PULL, &gpio_set},
	{CAM_RST, OUTPUT_PUSH_PULL, &gpio_set},
	{COMPASS_LED, OUTPUT_PUSH_PULL, &gpio_set},
	{GS_LED, OUTPUT_PUSH_PULL, &gpio_set},
	{HTS_LED, OUTPUT_PUSH_PULL, &gpio_set},
	{IRDA_CTL, OUTPUT_PUSH_PULL, &gpio_reset},
	{IRDA_RX, INPUT_HIGH_IMPEDANCE, NULL},
	{KEY_1, IRQ_MODE, &mode_rising},
	{KEY_2, IRQ_MODE, &mode_rising},
	{KEY_3, IRQ_MODE, &mode_rising},
	{LCD_DCX, OUTPUT_PUSH_PULL, &gpio_set},
	{LCD_PWR, OUTPUT_PUSH_PULL, &gpio_reset},
	{LCD_RST, OUTPUT_PUSH_PULL, &gpio_set},
	{PCIE_RST, OUTPUT_PUSH_PULL, &gpio_set},
	{PS_LED, OUTPUT_PUSH_PULL, &gpio_set},
	{SECURE_CLK, OUTPUT_PUSH_PULL, &gpio_set},
	{SECURE_IO, OUTPUT_PUSH_PULL, &gpio_set},
	{SECURE_RST, OUTPUT_PUSH_PULL, &gpio_set},
	{SIM_DET, INPUT_HIGH_IMPEDANCE, NULL},
	{USB_PCIE_SW, OUTPUT_PUSH_PULL, &gpio_set},
	{WIFI_RST, OUTPUT_PUSH_PULL, &gpio_set},
	{WIFI_WU, OUTPUT_PUSH_PULL, &gpio_set},
	{ZIGBEE_INT, IRQ_MODE, &mode_rising},
	{ZIGBEE_RST, OUTPUT_PUSH_PULL, &gpio_set},
};

i2c_dev_t brd_i2c1_dev = {AOS_PORT_I2C1, {0}, NULL};
i2c_dev_t brd_i2c2_dev = {AOS_PORT_I2C2, {0}, NULL};
i2c_dev_t brd_i2c3_dev = {AOS_PORT_I2C3, {0}, NULL};
/* brd_lpuart1_dev compat for vfs.c which will be compiled in Travis Ci script */
uart_dev_t uart_0 = {
	PORT_LPUART1,
	{LPUART1_BANDRATE, DATA_WIDTH_8BIT, NO_PARITY, STOP_BITS_1, FLOW_CONTROL_DISABLED, MODE_TX_RX},
	NULL
};
uart_dev_t brd_uart2_dev = {
	PORT_UART2,
	{UART2_BANDRATE, DATA_WIDTH_8BIT, NO_PARITY, STOP_BITS_1, FLOW_CONTROL_DISABLED, MODE_TX_RX},
	NULL
};
uart_dev_t brd_uart3_dev = {
	PORT_UART3,
	{UART3_BANDRATE, DATA_WIDTH_8BIT, NO_PARITY, STOP_BITS_1, FLOW_CONTROL_DISABLED, MODE_TX_RX},
	NULL
};

static void brd_peri_init(void)
{
	int i;
	int gpcfg_num = sizeof(brd_gpio_table) / sizeof(brd_gpio_table[0]);

	for (i = 0; i < gpcfg_num; ++i) {
		hal_gpio_init(&brd_gpio_table[i]);
	}
	hal_uart_init(&uart_0);
	hal_uart_init(&brd_uart2_dev);
	hal_uart_init(&brd_uart3_dev);
	hal_i2c_init(&brd_i2c1_dev);
	hal_i2c_init(&brd_i2c2_dev);
	hal_i2c_init(&brd_i2c3_dev);
}
#endif

